# Prova - parte 3

  
### 1. Importar os módulos necessários

In [1]:
import pandas as pd

### 2.Importe o dataset dessde endereço: [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### 3. Crie um dataframe com nome drinks.

In [2]:
drinks = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')

In [3]:
drinks

    country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0                             Afghanistan,0,0,0,0.0,AS
1                             Albania,89,132,54,4.9,EU
2                               Algeria,25,0,14,0.7,AF
3                          Andorra,245,138,312,12.4,EU
4                              Angola,217,57,45,5.9,AF
..                                                 ...
188                         Venezuela,333,100,3,7.7,SA
189                             Vietnam,111,2,1,2.0,AS
190                                 Yemen,6,0,0,0.1,AS
191                              Zambia,32,19,4,2.5,AF
192                            Zimbabwe,64,18,4,4.7,AF

[193 rows x 1 columns]

In [4]:
drinks[['country','beer_servings','spirit_servings','wine_servings','total_litres_of_pure_alcohol','continent']] = drinks['country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent'].str.split(',', expand=True)
drinks

,"country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent",country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,"Afghanistan,0,0,0,0.0,AS",Afghanistan,0,0,0,0.0,AS
1,"Albania,89,132,54,4.9,EU",Albania,89,132,54,4.9,EU
2,"Algeria,25,0,14,0.7,AF",Algeria,25,0,14,0.7,AF
3,"Andorra,245,138,312,12.4,EU",Andorra,245,138,312,12.4,EU
4,"Angola,217,57,45,5.9,AF",Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...,...
188,"Venezuela,333,100,3,7.7,SA",Venezuela,333,100,3,7.7,SA
189,"Vietnam,111,2,1,2.0,AS",Vietnam,111,2,1,2.0,AS
190,"Yemen,6,0,0,0.1,AS",Yemen,6,0,0,0.1,AS
191,"Zambia,32,19,4,2.5,AF",Zambia,32,19,4,2.5,AF
192,"Zimbabwe,64,18,4,4.7,AF",Zimbabwe,64,18,4,4.7,AF

In [5]:
drinks.drop('country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent', axis=1, inplace=True)

In [6]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### 4. Qual continente bebe mais cerveja em média?

In [7]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    object
 2   spirit_servings               193 non-null    object
 3   wine_servings                 193 non-null    object
 4   total_litres_of_pure_alcohol  193 non-null    object
 5   continent                     193 non-null    object
dtypes: object(6)
memory usage: 9.2+ KB

In [8]:
drinks['beer_servings'] = drinks['beer_servings'].astype('float')

In [9]:
per_continent = drinks.groupby('continent')

In [10]:
per_continent

In [11]:
per_continent['beer_servings'].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
NA    145.434783
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

### 5. Para cada continente, imprima a estatistica para o consumo de vinho.

In [12]:
drinks['wine_servings'] = drinks['wine_servings'].astype('float')

In [13]:
per_continent['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
NA          23.0   24.521739  28.266378  1.0   5.0   11.0   34.00  100.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### 6. Imprima a media de consumo de alcool por continente.

In [14]:
drinks['total_litres_of_pure_alcohol'] = drinks['total_litres_of_pure_alcohol'].astype('float')

In [15]:
per_continent['total_litres_of_pure_alcohol'].mean()

continent
AF    3.007547
AS    2.170455
EU    8.617778
NA    5.995652
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

### 7. Crie um novo dataframe com o minimo, maximo e media do consumo de ''spirit''.

In [16]:
numeric = drinks['spirit_servings'].astype('float')
minimo = numeric.min()
maximo = numeric.max()
media = numeric.mean()

In [17]:
minimo

0.0

In [18]:
maximo

438.0

In [19]:
media

80.99481865284974

In [20]:
data = {'minimo': [minimo],
       'maximo': [maximo],
       'media': [media]}
df = pd.DataFrame(data)
df

   minimo  maximo      media
0     0.0   438.0  80.994819